Repository: lion-simba/WinFF
Catalog: win32setup/languages/winff.*.po
Languages: ar

source: Add
ar: إضافة

source: (All Categories)
ar: جميع التصنيفات

source: Deinterlace
ar: فك التضفير

source: Clear
ar: تنظيف

source: Close
ar: إغلاق

# unit1.rsclosebtn
source: Options
ar: خيارات

source: Converting
ar: جاري التحويل

source: Could not find FFmpeg.
ar: لم أجد FFmpeg

source: Could not find FFPlay.
ar: لم أجد مشغلFFmpeg

source: Could Not Find File
ar: لم أجد الملف

source: Could not find presets file.
ar: لم أجد ملف النسبة

source: Bottom
ar: أسفل

source: Left
ar: يسار

source: Right
ar: يمين

source: Top
ar: أعلى

source: Display CMD Line
ar: عرض نافذة سطر الأوامر

source: Extension can not contain a period
ar: اللاحقة لا يمكن أن تحوي مده"~"

source: file does not exist
ar: الملف غير موجود

source: File
ar: ملف

# unit1.rsgroupbox1
source: Additional Options
ar: خيارات إضافية

source: Using two passes allows the encoder to gather information in the first run for enhanced quality.
ar: استخدام تمرير مزدوج يمكن المحول من استخلاص معلومات تحسن جودة الملف الناتج

source: add file(s) to the list for conversion
ar: إضافة ملف(ات) إلى قائمة التحويل

source: (<integer:integer> or <real>) the physical aspect ratio (DAR) of the target display.
ar: (<عدد صحيح:عدد صحيح> أو <عدد حقيقي>) تحديد نسبه عدد السطور إلي عرض الشاشة

# unit1.rshintaudiobitrate
source: (<integer>kb) the target kilobits/second that the stream should use
ar: (<عدد صحيح> ك.ب) المعدل المستهدف بالكيلو بت /ثانية الذي تود استعماله

source: (<integer>) number of audio channels
ar: (<عدد صحيح>) عدد قنوات الصوت

source: remove all files from the list
ar: إزالة كل الملفات من القائمة

source: start the conversion process
ar: ابدأ التحويل

source: name of the device or file type the video should be converted to
ar: اسم الجهاز أو نوع ملف الڤيديو ينبغي أن يحول إلى

source: removes interlacing from the video (if necessary)
ar: إزالة التضفير من الفيديو (عند الضرورة)

source: specific setting to use for the chosen device or file type
ar: استخدام أعدادات معينة لنوع الملف أو المشغل

source: (<real> or <integer>) the number of frames per second
ar: (<حقيقي> أو <عدد صحيح>) عدد الإطارات لكل ثانية

source: open or close the additional option window
ar: فتح أو إغلاق نافذة الخيارات الإضافية

source: the target location for the final video (choose a different folder than the source folder)
ar: مكان ملف الفيديو الناتج (اختر مجلدا مختلفا عن المجلد المصدر)

source: preview the selected source file with ffplay (good test to see if conversion is possible)
ar: معاينة الملف المصدر المختار باستخدام ffplay ( جيد لمعرفة إمكانية التحويل)

source: preview using the output settings
ar: المعاينة باستخدام أعدادات الخرج

source: remove the selected file(s) from the list
ar: إزالة الملفات المحددة من القائمة

source: (<integer>) the sampling frequency of the audio in Hertz
ar: (<عدد صحيح>) تردد معاينة الصوت بالهرتز

# unit1.rshintvideobitrate
source: (<integer>kb) the target kilobits/second that the stream should use
ar: (<عدد صحيح>كيلوبت) المعدل المستهدف بالكيلوبت/ثانية الذي تود استعماله

source: (<integer> X <integer>) the amount of pixels of information. For codecs that don't support pixel aspect ratio (PAR) this is the size of the video when viewed.
ar: (<عدد صحيح> × <عدد صحيح>) مجموع بكسلات البيانات.صالح للترميزات التي لا تدعم مقياس عدد السطور (PAR) ذلك يحجم الفيديو عند عرضه

source: Import Preset
ar: استيراد ملف

source: Invalid Preset File
ar: الملف المختار غير صالح

source: Convert To ...
ar: حول إلى ...

source: Audio Channels
ar: قنوات الصوت

# unit1.rslabel11
source: Output Folder
ar: مجلد الخرج

source: Device Preset
ar: نوع المشغل

# unit1.rslabel2
source: Output Folder
ar: مجلد الخرج

source: Video Bitrate
ar: معدل البتات

source: Frame Rate
ar: معدل الإطارات

source: Video Size
ar: حجم الفيديو

source: Aspect Ratio
ar: نسبة عدد السطور إلى العرض

source: Audio Bitrate
ar: معدل البتات

source: Sample Rate
ar: معدل العينات

source: Edit
ar: تحرير

# unit1.rsmenuitem2
source: About
ar: تحويل

source: Exit
ar: خروج

# unit1.rsmenuitem4
source: Presets
ar: نسب

source: Preferences
ar: تفضيلات

source: Help
ar: مساعدة

source: WinFF Forums
ar: منتدى WinFF

# unit1.rsmitabout
source: About
ar: حول

source: Documentation
ar: وثائق

source: WinFF Website
ar: موقع WinFF

source: Name Must be alphanumeric (a-z,A-Z,0-9)
ar: يجب أن يكون الاسم حرفي رقمي (a-z,A-Z,0-9)

# unit1.rsoptions
source: Options
ar: خيارات

# unit1.rsoptionsbtn
source: Options
ar: خيارات

source: 2 pass
ar: التمرير المزدوج

source: Pause on Finish
ar: إيقاف عند الانتهاء

source: Play
ar: شغل

source: Play Sound on Finish
ar: تشغيل الصوت عند الانتهاء

source: Please add at least 1 file to convert
ar: رجاء إضافة ملف على الأقل للتحويل

source: Please select a preset
ar: رجاء حدد ملفا

source: Preset: %s%s%s already exists
ar: الملف %s%s%s موجود بالفعل

source: The preset to import does not have an extension
ar: النسبة لا تحتوي على لاحقة

source: The preset to import does not have a label
ar: النسبة التي جلبتها لا تحتوي علي وسم خاص بها

source: Please select a preset to export
ar: فضلاً حدد النسبة لتصديرها

source: Preset with label: %s%s%s already exists
ar: النسبة ذات الوسم : %s%s%s موجودة بالفعل

source: Press Enter to Continue
ar: اضغط زر "Enter "للاستمرار

source: Preview
ar: معاينة

source: Remove
ar: أزل

source: Select Preset File
ar: اختر ملف النسبة

source: Select Video Files
ar: اختر ملفات الفيديو

# unit1.rsshowoptions
source: Additional Options
ar: خيارات إضافية

source: Shutdown on Finish
ar: إغلاق عند الانتهاء

source: Convert
ar: حول

source: The preset contains illegal characters
ar: النسبة تحتوي على حروف غير صالحة

source: Output Details
ar: تفاصيل الخرج

source: Video Settings
ar: أعدادات الفيديو

source: Audio Settings
ar: أعدادات الصوت

source: Additional Command Line Parameters (Advanced)
ar: معاملات سطر أوامر إضافية (متقدم)

source: Crop
ar: قصقصة الصورة

source: Add / Update
ar: إضافة/تحديث

# unit2.rscancelbtn
source: Cancel
ar: إلغاء

source: Create Preset:
ar: إنشاء نسبة

source: Delete
ar: حذف

# unit2.rsexport
source: Export
ar: تصدير

source: Edit Presets
ar: تحرير النسب

source: Import
ar: استيراد

source: Import Presets
ar: استيراد نسبة

# unit2.rslabel1
source: Presets
ar: النسب

source: Preset Name (One word , Only A-z 0-9)
ar: اسم النسبة (كلمة واحدة، حروف وأرقام فقط)

source: Preset Label
ar: وسم النسبة

source: Preset Command Line (no -i or output file)
ar: نسبة لسطر الأوامر (دون الخيار -i أو ملف الناتج)

source: Output File Extension (no ".")
ar: لاحقة الملف الناتج

source: Category
ar: التصنيف

source: Label must be unique.
ar: الوسم لابد أن يكون فريدا

source: Save
ar: حفظ

source: Remove Preset:
ar: إزالة نسبة

source: Update Preset:
ar: تحديث النسبة

source: You must enter the extension.
ar: لابد من إدخال لاحقة

source: You must enter a label.
ar: لابد من إدخال وسم

source: You must enter a name.
ar: إدخال الاسم

# unit3.rsbutton1
source: OK
ar: موافق

source: About WinFF
ar: حول WinFF

source: FFmpeg builds by
ar: FFmpeg تم بناؤه بواسطة

source: Thanks
ar: الشكر لـ

# unit4.rsbutton1
source: OK
ar: موافق

# unit4.rsbutton2
source: Cancel
ar: إلغاء

source: Remember Last Directory Used
ar: تذكر المجلد المستخدم أخيرا

source: Use CHCP for international characters
ar: استخدام محارف CHCP العالمية

source: Multithreading for Dual Core Processors
ar: معالجة متعددة الخيوط للمعالجات مزدوجة الأنوية

source: WinFF Preferences
ar: تفضيلات WinFF

source: Default Destination Directory
ar: وجهة المجلد الافتراضي

source: Path to FFmpeg.exe
ar: المسار إلى FFmpeg.exe

source: Path to FFPlay.exe
ar: المسار إلى FFPlay.exe

source: Path to FFmpeg Executable
ar: المسار التنفيذي إلى FFmpeg

source: Path to FFPlay Executable
ar: المسار إلى FFPlay التنفيذي

source: Terminal to run FFmpeg
ar: طرفية لتشغيل FFmpeg

source: Terminal Options (-e for Xterm , -x for Gnome Terminal
ar: خيارات للطرفية (-e في حالة طرفية اكس أو -x في حالة طرفية گنوم)

# unit4.rslabel8
source: Priority
ar: أولوية

source: General
ar: عام

source: Ms Windows
ar: مايكروسوفت وندوز

source: Linux
ar: لينوكس

source: High
ar: عالي

source: Idle
ar: عاطل

source: Normal
ar: عادي

# unit5.rsbutton1
source: OK
ar: موافق

source: FFmpeg Command Line
ar: سطر أوامر FFmpeg

# unit6.rscancelbtn
source: Cancel
ar: إلغاء

# unit6.rsexportbtn
source: Export
ar: تصدير

source: Export Presets
ar: تصدير النسب

source: Choose presets to export
ar: اختار النسب التي تود تصديرها
